/**
 * 1.მომხმარებელს შეაყვანინეთ დადებითი რიცხვი და დაბეჭდეთ 0-დან მაგ რიცხვამდე ყველა რიცხვი
 * 2.მომხმარებელს შეაყვანინეთ დადებითი რიცხვი და დაბეჭდეთ ყველა ლუწი რიცხვი მაგ რიცხვამდე
 * 3.მომხმარებელს შეაყვანინეთ დადებითი რიცხვი და დაბეჭდეთ ყველა რიცხვი კლებადობით 0-მდე
 * 5.გაქვთ შემდეგი ტიპის ერეი [[1,2],[3,4]], გამოიტანეთ თითო ელემენტი for ლუპის გამოყენებით
 * 6.შეაყვანინეთ მომხმარებელს რიცხვი და დაბეჭდეთ რიცხვები შემდეგი პატერნის მიხედვით
 *  მაგალითად 5 შეიყვანა მომხმარებელმა:
 *  1
 *  12
 *  123
 *  1234
 *  12345
 *
 */
let userValue = 6;

for (i = 1; i < userValue; i++) {
  let answer = "";
  for (j = 1; j <= i; j++) {
    answer = answer + j;
  }
  console.log(answer);
}
