// regular expressions

/**
 * . - ნებისმიერი სიმბოლო
 * [] - სიმბოლოების დიაპაზონი
 * $ - სტრიქონის დასასრული
 * ^ - სტრიქონის დასაწყისი
 * \ - (escaping character)
 * \d - ნებისმიერი ციფრი
 * \D - ყველაფერი ციფრის გარდა
 * \s - ჰარი (სფეისი)
 * \S - ყველაფერი სფეისის გარდა
 * \w - ნებისმიერი სიტყვის სიმბოლო
 * \W - ყველაფერი სიტყვის სიმბოლოს გარდა
 * \b - სიტყვის საზღვარი
 *
 *  quantifiers
 *  a{2} - იპოვე ორი a სიმბოლო ტექსტში
 *  a{2,5} - იპოვე 2-დან 5-მდე a სიმბოლო ტექსტში
 *  ba* - იპოვე ნებისმიერი b ან b რომელსაც a ესაზღბრება მარჯვნიდან უსასრულოჯერ
 *  ba+ - იპოვე ნებისმიერი b რომელსაც a ესაზღბრება მარჯვნიდან უსასრულოჯერ
 *  ba? - იპოვე ნებისმიერი b ან b რომელსაც a ესაზღბრება მარჯვნიდან ერთხელ
 */

const message = document.querySelector(".message");
console.log(message.innerHTML);
message.innerHTML = message.innerHTML.replace(/(hello|world)/gm, "***");
